content/posts/getting-started-org.md
+++
title = "Getting really started with Org mode."
date = 2020-05-15
lastmod = 2020-05-15T16:20:24+03:00
tags = ["emacs", "org"]
categories = ["emacs"]
draft = true
weight = 2002
featuredImage = "/images/unicorg.jpg"
+++

Time and time again we hear about how ludicrously awesome Org is, and how should
we use it for everything, from scheduling tasks to taking notes at university
and the like. Since currently I'm not going back to Uni any time soon, I will
try mainly to take advantage of the former feature.


## Agenda and other types of sorcery {#agenda-and-other-types-of-sorcery}

The agenda minibuffer could be called your "productivity hub", since from there
you can access your tags and TODO's, the former categoryzing your tasks, the
latter than visualizing them. To bring it up, you type:
